# Python Pandas ALL in ONE
# Written by Khairul E. Fahim
Pandas stands for panel data and is the core library for data manipulation and data analysis

Single dimensional data structure is caled as series object. Multi dimensional data structure is called as data-frame. Let's start with series object. As I have said before series object is a one-dimensional labeled array. First thing we need to do is to import pandas. If we want to build a series, we need to [] with different values. One more thing we need to remember is that in Python indexing always starts from zero.

In [2]:
import pandas as pd
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

# Changing Index

In [4]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

# Series object from dictionary

In [6]:
pd.Series({'a':10,'b':20,'c':30}) #series has to be written with capital S (Series)

a    10
b    20
c    30
dtype: int64

# Changing Index
Index can be changed using the index attribute

In [7]:
pd.Series({'a':10,'b':20,'c':30},index=['b','c','d','a'])

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

As we can see above there are 4 indexes against 3 dictionary entries

# Extracting Individul Elements

# Extracting Single Element

In [8]:
s1=pd.Series([1,2,3,4,5,6,7,8,9])
s1[3]

4

# Extracting Elements from back
If we want to extract element from back we can use [-1:] notation. [-3} means it will strat extracting data from the third last element.

In [9]:
s1[-3:]

6    7
7    8
8    9
dtype: int64

# Extracting a series of elements
Following example shows how we can extract a total of 5 datas strating from index 0 and ending at index 4

In [10]:
s1[:4]

0    1
1    2
2    3
3    4
dtype: int64

# Basic Math Operation on Series

In [11]:
s1+5

0     6
1     7
2     8
3     9
4    10
5    11
6    12
7    13
8    14
dtype: int64

In [12]:
s1=pd.Series([1,2,3,4,5,6,7,8,9])
s2=pd.Series([3,4,5,6,8,9,2,5,6])
s1+s2

0     4
1     6
2     8
3    10
4    13
5    15
6     9
7    13
8    15
dtype: int64

# Pandas Dataframe

In dataframes we will have column names as well as row names.

# Creating a dataframe
data frame can be created using key value pair

In [13]:
pd.DataFrame({'Name':['Rahim','Karim','Mokhles'],'Marks':[70,80,90]})

      Name  Marks
0    Rahim     70
1    Karim     80
2  Mokhles     90

# Dataframe In-Built Function
Some built in functions are head(),shape(),tail(),describe()

# Reading a data set 
The file that we are using for reading this data set is uploaded in this repository

In [18]:
iris_data = pd.read_csv('iris.csv')
iris_data

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# For reading first five values of .csv file, head() method can be used

In [19]:
iris_data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# Tail method
Tail method can be used to see the last five elements of the entry

In [20]:
iris_data.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# Shape method
Shape method is used to find out the total number of rows and columns in a DataFrame

In [22]:
iris_data.shape

(150, 5)

# Describe method
To find out different parameters such as count, mean, median,std  describe method can be used.

In [23]:
iris_data.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

# .iloc[] method
.iloc method is used to extract data set. Lets see one example. Following example shows how we can extract 3 rows and 2 columns

In [25]:
iris_data.iloc[0:3,0:2]

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

# Following example shows us an example of extracting row number 5 to 10 and row number 2 to last

In [27]:
iris_data.iloc[5:11,2:]

    petal_length  petal_width species
5            1.7          0.4  setosa
6            1.4          0.3  setosa
7            1.5          0.2  setosa
8            1.4          0.2  setosa
9            1.5          0.1  setosa
10           1.5          0.2  setosa

# .loc method 
.loc method can be used for customized extraction for rows and columns. Say for example we want to extract rows 5 to 10 along with petal_length and species column

In [28]:
iris_data.loc[1:10,('petal_length','species')]

    petal_length species
1            1.4  setosa
2            1.3  setosa
3            1.5  setosa
4            1.4  setosa
5            1.7  setosa
6            1.4  setosa
7            1.5  setosa
8            1.4  setosa
9            1.5  setosa
10           1.5  setosa

In [30]:
iris_data.drop('petal_length',axis=1) # If we want to drop a row we should've written axis=0

     sepal_length  sepal_width  petal_width    species
0             5.1          3.5          0.2     setosa
1             4.9          3.0          0.2     setosa
2             4.7          3.2          0.2     setosa
3             4.6          3.1          0.2     setosa
4             5.0          3.6          0.2     setosa
..            ...          ...          ...        ...
145           6.7          3.0          2.3  virginica
146           6.3          2.5          1.9  virginica
147           6.5          3.0          2.0  virginica
148           6.2          3.4          2.3  virginica
149           5.9          3.0          1.8  virginica

[150 rows x 4 columns]

# Droping rows
Following exam shows how to drop 1,2,3 row

In [31]:
iris_data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [32]:
iris_data.drop([1,2,3],axis=0)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[147 rows x 5 columns]

# max,min,mean,median

In [33]:
iris_data.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [34]:
iris_data.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [35]:
iris_data.mean()

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

In [36]:
iris_data.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

# Customized user defined function (IMPORTANT)

In [37]:
def double_make(s):
    return s*2

Now let's apply our user defined function on sepal_length and sepal_width

In [39]:
iris_data[['sepal_length','sepal_width']].apply(double_make)

     sepal_length  sepal_width
0            10.2          7.0
1             9.8          6.0
2             9.4          6.4
3             9.2          6.2
4            10.0          7.2
..            ...          ...
145          13.4          6.0
146          12.6          5.0
147          13.0          6.0
148          12.4          6.8
149          11.8          6.0

[150 rows x 2 columns]

# value_counts

In [41]:
iris_data['species'].value_counts()

setosa        50
virginica     50
versicolor    50
Name: species, dtype: int64

# Sorting (IMPORTANT)
It can be sorted using .sort_values method

In [42]:
iris_data.sort_values(by='sepal_width')

     sepal_length  sepal_width  petal_length  petal_width     species
60            5.0          2.0           3.5          1.0  versicolor
62            6.0          2.2           4.0          1.0  versicolor
119           6.0          2.2           5.0          1.5   virginica
68            6.2          2.2           4.5          1.5  versicolor
41            4.5          2.3           1.3          0.3      setosa
..            ...          ...           ...          ...         ...
16            5.4          3.9           1.3          0.4      setosa
14            5.8          4.0           1.2          0.2      setosa
32            5.2          4.1           1.5          0.1      setosa
33            5.5          4.2           1.4          0.2      setosa
15            5.7          4.4           1.5          0.4      setosa

[150 rows x 5 columns]